{"id": 1, "text": "Lionel Andrés Messi is an Argentine professional footballer widely regarded as one of the greatest players in the sport's history. Renowned for his dribbling, playmaking, and goal-scoring consistency, he has defined an era in club and international football with unprecedented records and sustained excellence.\n\nEarly life\nBorn on 24 June 1987 in Rosario, Argentina, Messi grew up in a footballing household and joined Newell's Old Boys youth ranks.\n\nDiagnosed with a growth hormone deficiency, he moved to Barcelona at 13 after the club offered to cover his medical treatment.\n\nHis youth development at La Masia refined his balance, vision, and close control, shaping the foundation for his trademark low center of gravity and elite technical execution.\n\nBarcelona era\nSenior debut at 17 in 2004; be"}
{"id": 2, "text": "k low center of gravity and elite technical execution.\n\nBarcelona era\nSenior debut at 17 in 2004; became Barcelona's all-time top scorer with a staggering goal tally and assist count across all competitions.\n\nUnder coaches Frank Rijkaard and Pep Guardiola, Messi evolved from a right-sided forward into a false nine, then into a free-roaming playmaker-forward hybrid.\n\nFormed historic partnerships with Xavi, Iniesta, Neymar, and Suarez, driving Barcelona to domestic and European dominance.\n\nKey achievements included multiple La Liga titles, UEFA Champions League triumphs, and the 2011 peak-era side often cited as one of the greatest club teams ever.\n\nThe 2012 calendar year yielded a world-record 91 goals, illustrating his capacity for consistent, multi-competition output.\n\nPSG chapter\nJoined "}
{"id": 3, "text": "d 91 goals, illustrating his capacity for consistent, multi-competition output.\n\nPSG chapter\nJoined Paris Saint-Germain in 2021, adapting to a new league and tactical environment while linking with Kylian Mbappé and Neymar.\n\nContributed as a chance creator and scorer, adding Ligue 1 titles and honing a deeper playmaking role that emphasized progressive passing, through-balls, and set-piece craft.\n\nInter Miami impact\nMoved to Inter Miami in 2023 and immediately transformed the club's trajectory, winning the Leagues Cup 2023 and energizing MLS viewership and global attention.\n\nOperated as a roaming 10/false nine, orchestrating play, finishing chances, and elevating teammates through tempo control and final-third decision-making.\n\nArgentina journey\nDebuted for the senior national team in 2005"}
{"id": 4, "text": "rol and final-third decision-making.\n\nArgentina journey\nDebuted for the senior national team in 2005, facing early scrutiny over international finals defeats but showing unwavering leadership and resilience.\n\nCaptained Argentina to Copa América 2021, ending a long national drought; then won the Finalissima 2022 against Italy with a dominant display.\n\nCrowned FIFA World Cup champion in 2022, producing decisive goals and assists, and receiving the Golden Ball as the tournament's best player.\n\nAdded the Copa América 2024 title, cementing a legacy of sustained international success across multiple cycles.\n\nPlaying style\nDribbling: Signature close control, rapid hip feints, and body swerves create separation in tight spaces and at speed.\n\nVision: Elite spatial awareness and timing enable defens"}
{"id": 5, "text": "e separation in tight spaces and at speed.\n\nVision: Elite spatial awareness and timing enable defense-splitting passes and intelligent overloads between lines.\n\nFinishing: Precise left-footed strikes, low-driven finishes, and curling shots from the edge of the box.\n\nSet pieces: Prolific free-kick specialist with a variety of trajectories and wall-bypassing techniques.\n\nOff-ball intelligence: Drift-and-receive patterns that create passing triangles, interior overloads, and progressive passing lanes.\n\nPress resistance: Ability to receive under pressure, turn defenders, and retain possession in small pockets.\n\nLeadership: Calmer, example-led captaincy built on consistency, clutch performances, and raising collective tempo.\n\nRecords and milestones\nMost Ballon d'Or awards with a record total, r"}
{"id": 6, "text": "and raising collective tempo.\n\nRecords and milestones\nMost Ballon d'Or awards with a record total, reflecting dominance across different tactical eras and competitions.\n\nMost goals in a calendar year with 91 in 2012, a modern benchmark for sustained match-to-match scoring.\n\nAll-time top scorer for Barcelona and La Liga, with records for goals and assists that spanned over a decade of league play.\n\nMultiple European Golden Shoes and Champions League scoring titles, showcasing repeatable output against elite opposition.\n\nTwo World Cup Golden Balls (2014, 2022), underlining top-tier influence across separate tournament cycles.\n\nClub and country career surpassing 800 total senior goals and a massive assist count, spanning domestic leagues, international play, and continental club competitions."}
{"id": 7, "text": "sive assist count, spanning domestic leagues, international play, and continental club competitions."}
